In [1]:
import pandas as pd

In [2]:
#criar nosso objeto
people = {
    'first': ['Jose Edmar','Lucas', 'Adeguimar'],
    'last': ['Siqueira', 'Siqueira', 'Lacerda'],
    'email': ['edmar.ade@gmail.com', 'lucas@hotmail.com','adeguimar@gmail.com']
}

In [3]:
#transforma objeto em DataFrame
df = pd.DataFrame(people)

In [4]:
df

        first      last                email
0  Jose Edmar  Siqueira  edmar.ade@gmail.com
1       Lucas  Siqueira    lucas@hotmail.com
2   Adeguimar   Lacerda  adeguimar@gmail.com

In [5]:
#vamos criar um campo com primeiro e ultimo nome
df['first'] + ' ' + df['last']

0    Jose Edmar Siqueira
1         Lucas Siqueira
2      Adeguimar Lacerda
dtype: object

In [6]:
#Adicionar o campo como full_name no dataFrame
df['Full_name'] = df['first'] + ' ' + df['last']

In [7]:
#visualizar dataFrame
df

        first      last                email            Full_name
0  Jose Edmar  Siqueira  edmar.ade@gmail.com  Jose Edmar Siqueira
1       Lucas  Siqueira    lucas@hotmail.com       Lucas Siqueira
2   Adeguimar   Lacerda  adeguimar@gmail.com    Adeguimar Lacerda

In [8]:
# para remover um ou varias colunas usamos o drop
df.drop(columns=['first', 'last'])

                 email            Full_name
0  edmar.ade@gmail.com  Jose Edmar Siqueira
1    lucas@hotmail.com       Lucas Siqueira
2  adeguimar@gmail.com    Adeguimar Lacerda

In [9]:
#ao executar ele nos mostra como ficara o dataFrane porém não modifico no DataFrame ainda para modificar devemos usar inplace=True
df.drop(columns=['first', 'last'], inplace=True)

In [10]:
#agora podemos ver a mudança no DataFrame
df

                 email            Full_name
0  edmar.ade@gmail.com  Jose Edmar Siqueira
1    lucas@hotmail.com       Lucas Siqueira
2  adeguimar@gmail.com    Adeguimar Lacerda

In [12]:
#vamos voltar a tabela como estava com metodo split
df['Full_name'].str.split(' ')

0    [Jose, Edmar, Siqueira]
1          [Lucas, Siqueira]
2       [Adeguimar, Lacerda]
Name: Full_name, dtype: object

In [13]:
df

                 email            Full_name
0  edmar.ade@gmail.com  Jose Edmar Siqueira
1    lucas@hotmail.com       Lucas Siqueira
2  adeguimar@gmail.com    Adeguimar Lacerda

In [16]:
#modificar o nome para funcionar o split
df.loc[0, 'Full_name'] = 'Jose_edmar Siqueira'

In [17]:
df

                 email            Full_name
0  edmar.ade@gmail.com  Jose_edmar Siqueira
1    lucas@hotmail.com       Lucas Siqueira
2  adeguimar@gmail.com    Adeguimar Lacerda

In [18]:
#Executar novamente etodo split
df['Full_name'].str.split(' ')

0    [Jose_edmar, Siqueira]
1         [Lucas, Siqueira]
2      [Adeguimar, Lacerda]
Name: Full_name, dtype: object

In [20]:
#Para expandir a lista devemos usar o metodo expand
df['Full_name'].str.split(' ', expand=True)

            0         1
0  Jose_edmar  Siqueira
1       Lucas  Siqueira
2   Adeguimar   Lacerda

In [22]:
#agora podemos criar novamente os campo na DataFrame
df[['first', 'last']] = df['Full_name'].str.split(' ', expand=True)

In [23]:
df

                 email            Full_name       first      last
0  edmar.ade@gmail.com  Jose_edmar Siqueira  Jose_edmar  Siqueira
1    lucas@hotmail.com       Lucas Siqueira       Lucas  Siqueira
2  adeguimar@gmail.com    Adeguimar Lacerda   Adeguimar   Lacerda

In [26]:
#Modificar a coluna First e tirar o idenline do nome
df.loc[0, 'first'] = 'Jose Edmar'

In [27]:
df

                 email            Full_name       first      last
0  edmar.ade@gmail.com  Jose_edmar Siqueira  Jose Edmar  Siqueira
1    lucas@hotmail.com       Lucas Siqueira       Lucas  Siqueira
2  adeguimar@gmail.com    Adeguimar Lacerda   Adeguimar   Lacerda

In [29]:
# Adicionar uma unica linha ao DataFrame, para isso usamos append com paramentro ignore_index
df.append({'first':'Tony'}, ignore_index=True)

                 email            Full_name       first      last
0  edmar.ade@gmail.com  Jose_edmar Siqueira  Jose Edmar  Siqueira
1    lucas@hotmail.com       Lucas Siqueira       Lucas  Siqueira
2  adeguimar@gmail.com    Adeguimar Lacerda   Adeguimar   Lacerda
3                  NaN                  NaN        Tony       NaN

In [33]:
# Criar objeto para adcionar no DataFrame
people = {
    'first': ['Maria','Jonathan',],
    'last': ['Siqueira', 'Silva',],
    'email': ['maria@gmail.com','jonathan@gmail.com']
}
df2 =  pd.DataFrame(people)

In [34]:
df2

      first      last               email
0     Maria  Siqueira     maria@gmail.com
1  Jonathan     Silva  jonathan@gmail.com

In [37]:
#Adionar Df2 no DF
df.append(df2, ignore_index=True)

                 email            Full_name       first      last
0  edmar.ade@gmail.com  Jose_edmar Siqueira  Jose Edmar  Siqueira
1    lucas@hotmail.com       Lucas Siqueira       Lucas  Siqueira
2  adeguimar@gmail.com    Adeguimar Lacerda   Adeguimar   Lacerda
3      maria@gmail.com                  NaN       Maria  Siqueira
4   jonathan@gmail.com                  NaN    Jonathan     Silva

In [40]:
#Incluir a mudança no DF 
df = df.append(df2, ignore_index=True)

In [41]:
#visualizar as mudanças
df

                 email            Full_name       first      last
0  edmar.ade@gmail.com  Jose_edmar Siqueira  Jose Edmar  Siqueira
1    lucas@hotmail.com       Lucas Siqueira       Lucas  Siqueira
2  adeguimar@gmail.com    Adeguimar Lacerda   Adeguimar   Lacerda
3      maria@gmail.com                  NaN       Maria  Siqueira
4   jonathan@gmail.com                  NaN    Jonathan     Silva

In [42]:
#remover uma linha
df.drop(index=4)

                 email            Full_name       first      last
0  edmar.ade@gmail.com  Jose_edmar Siqueira  Jose Edmar  Siqueira
1    lucas@hotmail.com       Lucas Siqueira       Lucas  Siqueira
2  adeguimar@gmail.com    Adeguimar Lacerda   Adeguimar   Lacerda
3      maria@gmail.com                  NaN       Maria  Siqueira

In [43]:
#como vemos ele ainda está vamos fazer realmente a mudança
df

                 email            Full_name       first      last
0  edmar.ade@gmail.com  Jose_edmar Siqueira  Jose Edmar  Siqueira
1    lucas@hotmail.com       Lucas Siqueira       Lucas  Siqueira
2  adeguimar@gmail.com    Adeguimar Lacerda   Adeguimar   Lacerda
3      maria@gmail.com                  NaN       Maria  Siqueira
4   jonathan@gmail.com                  NaN    Jonathan     Silva

In [46]:
#vamos usar um filtro para pegar os id, vai remover todos que tem com last igual ao filtro
filt = df['last'] == 'Siqueira'
df.drop(index=df[filt].index)

                 email          Full_name      first     last
2  adeguimar@gmail.com  Adeguimar Lacerda  Adeguimar  Lacerda
4   jonathan@gmail.com                NaN   Jonathan    Silva

In [45]:
df

                 email            Full_name       first      last
0  edmar.ade@gmail.com  Jose_edmar Siqueira  Jose Edmar  Siqueira
1    lucas@hotmail.com       Lucas Siqueira       Lucas  Siqueira
2  adeguimar@gmail.com    Adeguimar Lacerda   Adeguimar   Lacerda
3      maria@gmail.com                  NaN       Maria  Siqueira
4   jonathan@gmail.com                  NaN    Jonathan     Silva